[["BIO 104 EVOLUTION AND SOCIETY", "In this course you will learn to identify questions that can or cannot be answered by science, the assumptions made by science, how evidence is connected to predictions, and evaluate the role of communication and peer-review to promote scientific progress. It also includes current and foundational issues in evolution starting with Darwin's voyage of the Beagle, the Darwinian Natural Selection Theory, and the impact of evolution on disease and society.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=104"], ["BIO 115 INTRODUCTION TO BIOLOGY", "Deals with the scientific method, biological chemistry, structure, function, and heredity of cells and organisms, evolution and ecology. Cannot receive credit for both BIO 115 and BIO 155, No credit for Biology majors or minors.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=115"], ["BIO 126 BRAIN AND BEHAVIOR", "Examines basic concepts in neurobiology. Specifically how the brain is organized, how it sends messages throughout the body, and how these messages turn into daily activities such as seeing, eating, and walking. How these behaviors are altered due to disease or injury of the brain is also discussed. Cannot receive credit for both BIO 126 and BIO 162. Formerly BIO 206. No credit for Biology majors or minors", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=126"], ["BIO 134 HOW THE HUMAN BODY WORKS", "Fundamentals of human body functions through an examination of organs and organ systems. The quantitative component of this course will explore the concepts of scientific discovery through structured out-of-class projects. Cannot receive credit for both BIO 202 and BIO 134. Formerly BIO 224. No credit for Biology majors or minors", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=134"], ["BIO 155 INTRODUCTION TO BIOLOGY WITH LABORATORY", "This lecture-laboratory course deals with the scientific method, biological chemistry, structure and function of cells, organs, and organ systems, heredity, evolution and ecology. Course includes a laboratory experience involving biological concepts discussed in class. Cannot receive credit for both BIO 115 and BIO 155. No credit for Biology majors or minors.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=155"], ["BIO 191 GENERAL BIOLOGY I FOR SCIENCE MAJORS", "Focuses on the unity of life: its biochemical and cellular makeup and functions, the acquisition and utilization of energy, and the storage and utilization of genetic information. Lecture-laboratory. CHE 130 and CHE 131 are recommended as corequisites. PREREQUISITE(S): MAT 130 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=191"], ["BIO 193 GENERAL BIOLOGY III FOR SCIENCE MAJORS", "Deals primarily with diversity and development within the plant and animal kingdoms including basic principles of physiology. Lecture-laboratory. PREREQUISITE(S): A grade of C- or higher in BIO 192 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=193"], ["BIO 206 BIOSTATISTICS", "A survey of a variety of statistical methods used to analyze biological data. PREREQUISITE(S): BIO 193 or instructor consent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=206"], ["BIO 210 MICROBIOLOGY", "Biology of microorganisms with emphasis on viruses, bacteria, fungi, and protozoa. Lecture-laboratory. PREREQUISITE(S): A grade of C- or higher in BIO 191 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=210"], ["BIO 215 ECOLOGY", "Study of organismal interactions; responses of individuals, populations and natural communities to their external environment. Lecture-laboratory. PREREQUISITE(S): BIO 193 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=215"], ["BIO 235 EVOLUTION", "This lecture/laboratory course will examine basic selection, population genetics, development, speciation, extinction, systematics, and the history of evolution. In the lab, students will learn some of the modern research methods used in the study of evolution. PREREQUISITE(S): BIO 193 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=235"], ["BIO 250 CELL BIOLOGY", "Fundamentals of cell form and function studied at the molecular and organelle level, including basic cellular biochemistry, ultrastructure and physiology. Lecture-laboratory. PREREQUISITE(S): BIO 193 and (CHE 134 or CHE 138) are a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=250"], ["BIO 310 VERTEBRATE PHYSIOLOGY", "Functions and regulatory mechanisms of vertebrate cells, organs and organ systems with special emphasis on mammals. Lecture-Laboratory. PREREQUISITE(S): BIO 250 or instructor consent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=310"], ["BIO 330 DEVELOPMENTAL BIOLOGY", "A survey of developmental phenomena in animals from fertilization to sexual maturity. Students will gain a current understanding of the genetic, cellular, and environmental mechanisms that shape the body and its major organs. PREREQUISITE(S): BIO 250 and BIO 260 are a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=330"], ["BIO 339 CELLULAR NEUROBIOLOGY", "A study of the cellular and molecular mechanisms of the nervous system and the role they play in neural signaling, learning and memory. Cross-listed as BIO 439. PREREQUISITE(S): BIO 250 or PSY 377 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=339"], ["BIO 342 COGNITIVE NEUROSCIENCE", "This course explores the neuroscience of human behaviors such as emotions, attention, executive function, language, learning, memory, and social interaction by exploring both the underlying biological mechanisms and the psychological theories behind these behaviors. Cognitive Neuroscience is an emerging field of study that attempts to help one gain an understanding of the interdisciplinary nature of the human mind. PREREQUISITE(S): BIO 339 or BIO 340 or BIO 341 or PSY 377 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=342"], ["BIO 345 TOPICS IN PALEOBIOLOGY", "A seminar course examining various topics in paleobiology (the study of ancient life) including morphological concepts, macroevolutionary processes, extinction events, phylogenetic systematics, paleoecology, paleoebiogeography, and the adequacy of the fossil record. Readings include classic and recent articles in the fields of paleobiology. PREREQUISITE(S): BIO 192, BIO 193 and (BIO 215 or BIO 235) or instructor's consent are a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=345"], ["BIO 380 CANCER BIOLOGY", "This course will explore the cellular and molecular aspects of cancer. Topics will include the pathology and epidemiology of cancer, the origin and spread of cancer, hereditary and familial cancers, cancer associated genes and strategies of cancer therapy. PREREQUISITE(S): BIO 250 and BIO 260 are a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=380"], ["BIO 381 TOPICS IN CANCER", "This course is a seminar based course that discusses current topics in the field of cancer biology from a cellular and molecular perspective. This course demonstrates the recent advances made in the most common cancers in the western world, toward etiology, diagnosis, therapy and prevention. Scientific articles taken from peer-reviewed scientific journals will illustrate available and potential chemotherapeutic approaches towards achieving a treatment for the most common cancers. PREREQUISITE(S): BIO 250 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=381"], ["BIO 385 MAMMALIAN REPRODUCTION", "Molecular, cellular, physiological, and behavioral aspects of mammalian reproduction. Mechanisms and strategies used by mammals in reproductive processes including sexual differentiation, gamete production, puberty, reproductive hormone cyclicity, neuroendocrine control mechanisms, pregnancy, parturition, and reproductive behavior. Cross-listed with BIO 485. PREREQUISITE(S): BIO 250 and BIO 310 or instructor consent are a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=385"], ["BIO 395 BIOLOGY CAPSTONE SEMINAR", "The aim of this course is to integrate current biological view(s) of humanity with the perspectives of the liberal studies curriculum. Students will develop and debate topics that demonstrate mastery of the biology core curriculum (cell biology, genetics, physiology and ecology) while touching on history, philosophy, ethics and the law.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=395"], ["BIO 430 DEVELOPMENTAL BIOLOGY", "A survey of developmental phenomena in animals from fertilization to sexual maturity. Topics include gametogenesis, early cell divisions, organ formation, metamorphosis, regeneration, birth defects, stem cells, reproductive technology and mammalian cloning. Lecture-laboratory.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=430"], ["BIO 439 CELLULAR NEUROBIOLOGY", "A study of the cellular and molecular mechanisms of the nervous system and the role they play in neural signaling, learning and memory.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=439"], ["BIO 442 COGNITIVE NEUROSCIENCE", "This course explores the neuroscience of human behaviors such as emotions, attention, executive function, language, learning, memory, and social interaction by exploring both the underlying biological mechanisms and the psychological theories behind these behaviors. Cognitive Neuroscience is an emerging field of study that attempts to help one gain an understanding of the interdisciplinary nature of the human mind.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=442"], ["BIO 445 TOPICS IN PALEOBIOLOGY", "A seminar course examining various topics in paleobiology (the study of ancient life) including morphological concepts, macroevolutionary processes, extinction events, phylogenetic systematics, paleoecology, paleobiogeography, and the adequacy of the fossil record. Readings include classic and recent articles in the fields of paleobiology.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=445"], ["BIO 480 CANCER BIOLOGY", "This course will explore the cellular and molecular aspects of cancer. Topics will include the pathology and epidemiology of cancer, the origin and spread of cancer, hereditary and familial cancers, cancer associated genes and strategies of cancer therapy.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=480"], ["BIO 481 TOPICS IN CANCER", "This course is a seminar based course that discusses current topics in the field of cancer biology from a cellular and molecular perspective. This course demonstrates the recent advances made in the most common cancers in the western world, toward etiology, diagnosis, therapy and prevention. Scientific articles taken from peer-reviewed scientific journals will illustrate available and potential chemotherapeutic approaches towards achieving a treatment for the most common cancers.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=481"], ["BIO 485 MAMMALIAN REPRODUCTION", "Molecular, cellular, physiological, and behavioral aspects of mammalian reproduction. Mechanisms and strategies used by mammals in reproductive processes including sexual differentiation, gamete production, puberty, reproductive hormone cyclicity, neuroendocrine control mechanisms, pregnancy, parturition, and reproductive behavior. Cross-listed with BIO 385.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=485"], ["BIO 495 INTRODUCTION TO GRADUATE STUDY", "Presents the biology faculty and facilities. Various research and teaching methods in biology will be explored. Required of all graduate students.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=495"], ["BIO 502 CANDIDACY CONTINUATION", "Students who have completed their coursework but who must take extra time to complete the requirements for the Master's thesis (MS), or final project (MA), must enroll in candidacy continuation each quarter of the academic year until the Master's requirement has been completed. This course carries part-time student status. Non-credit.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=502"], ["BIO 503 CANDIDACY MAINTENANCE", "Placeholder course for students NOT actively working on their thesis. This course is meant only to maintain university student status, it will not give the student full- or part-time student status and will not permit deferment of student loans. Non-credit.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=BIO&catalog_nbr=503"], ["CMN 101 INTRODUCTION TO HUMAN COMMUNICATION", "This course provides an introduction to the field of relational, group and organizational communication. Students become acquainted with the basic terms, concepts and theoretical perspectives used to examine communication in dyadic, group and organizational contexts.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMN&catalog_nbr=101"], ["CMN 103 INTERCULTURAL COMMUNICATION", "Examines the role culture plays in interethnic and international communication. Explores differences and similarities in cultural values and communication behaviors between and among diverse cultures and develops intercultural competence. Critiques stereotypes and increases cultural sensitivity.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMN&catalog_nbr=103"], ["CMN 104 PUBLIC SPEAKING", "Introduction to the effective communication skills required for public speaking in organizational and public settings. The course stresses the important role public speaking plays in a democratic society and encourages students to address topics of a political and/or social nature. The course emphasizes the process of researching, preparing and presenting a variety of speeches. Additionally, it includes units on delivery and performance skills, effective use of language for the spoken word, clear organization of messages, critical listening and thinking skills, and tailoring messages to a variety of audiences in a diverse society. (FORMERLY INTC 220)", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMN&catalog_nbr=104"], ["CMN 396 CAPSTONE IN COMMUNICATION", "Making a difference: Communication Senior Capstone. Exploration of student skills, knowledge and interests, as well as how these might have a concrete contribution to contemporary society. Students cannot earn credit for both CMN396 and PRAD396. PREREQUISITE(S): Status as a College of Communication major with senior standing is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMN&catalog_nbr=396"], ["CMN 50 ACTIVE STATUS CONTINUATION", "Making a difference: Communication Senior Capstone. Exploration of student skills, knowledge and interests, as well as how these might have a concrete contribution to contemporary society. Students cannot earn credit for both CMN396 and PRAD396. PREREQUISITE(S): Status as a College of Communication major with senior standing is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMN&catalog_nbr=50"], ["CMNS 230 PERFORMANCE", "Making a difference: Communication Senior Capstone. Exploration of student skills, knowledge and interests, as well as how these might have a concrete contribution to contemporary society. Students cannot earn credit for both CMN396 and PRAD396. PREREQUISITE(S): Status as a College of Communication major with senior standing is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=230"], ["CMNS 311 TOPICS IN RELATIONAL COMMUNICATION", "Making a difference: Communication Senior Capstone. Exploration of student skills, knowledge and interests, as well as how these might have a concrete contribution to contemporary society. Students cannot earn credit for both CMN396 and PRAD396. PREREQUISITE(S): Status as a College of Communication major with senior standing is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=311"], ["CMNS 312 EVOLUTION AND COMMUNICATION", "Making a difference: Communication Senior Capstone. Exploration of student skills, knowledge and interests, as well as how these might have a concrete contribution to contemporary society. Students cannot earn credit for both CMN396 and PRAD396. PREREQUISITE(S): Status as a College of Communication major with senior standing is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=312"], ["CMNS 313 NONVERBAL COMMUNICATION", "Making a difference: Communication Senior Capstone. Exploration of student skills, knowledge and interests, as well as how these might have a concrete contribution to contemporary society. Students cannot earn credit for both CMN396 and PRAD396. PREREQUISITE(S): Status as a College of Communication major with senior standing is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=313"], ["CMNS 315 HEALTH COMMUNICATION", "This course surveys the theory and practice of communication in the health care setting. Topics include the dynamics of doctor-patient interaction and the cursory nature of health care campaigns. (Organizational, Relational)", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=315"], ["CMNS 320 DECEPTIVE COMMUNICATION", "This course surveys the theory and practice of communication in the health care setting. Topics include the dynamics of doctor-patient interaction and the cursory nature of health care campaigns. (Organizational, Relational)", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=320"], ["CMNS 324 CULTURE OF CONSUMPTION", "This course surveys the theory and practice of communication in the health care setting. Topics include the dynamics of doctor-patient interaction and the cursory nature of health care campaigns. (Organizational, Relational)", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=324"], ["CMNS 337 ASIAN-AMERICAN MEDIA REPRESENTATIONS", "This course surveys the theory and practice of communication in the health care setting. Topics include the dynamics of doctor-patient interaction and the cursory nature of health care campaigns. (Organizational, Relational)", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=337"], ["CMNS 369 PERFORMANCE OF HUMOR", "This course surveys the theory and practice of communication in the health care setting. Topics include the dynamics of doctor-patient interaction and the cursory nature of health care campaigns. (Organizational, Relational)", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=369"], ["CMNS 500 FOUNDATIONS IN GRADUATE COMMUNICATION STUDIES", "This course provides an orientation and introduction to the Communication Studies Graduate Programs (Health, Relational, Organizational/Multicultural) in the College of Communication, as well as the larger field of communication studies. The course provides an orientation into graduate program policies, program faculty, DePaul resources, the broader academic discipline of Communication and potential career opportunities for graduates and resources in the field. In addition, the course provides a survey of research paradigms and methodologies, while offering students an introduction to areas of faculty specialization. Students will develop a personalized study plan and a literature review related to their area of research interest. This class will be primarily lecture/discussion based, emphasizing student participation, active learning, and diverse disciplinary perspectives. The course will take the form of several guest lectures, critical reading and reflection of research, and discussion. Students will be required to participate in small group discussions, and submit papers and other written assignments. PREREQUISITE(S): Status as a Graduate Communication student, Health Communication student, or Relational Communication student is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=500"], ["CMNS 509 SPECIAL TOPICS IN MULTICULTURAL COMMUNICATION", "Course covers a variety of topics that address theories about multicultural communication such as culture, gender, sexual orientation, race, and ethnicity. PREREQUISITE(S): Status as a Graduate Communication student or department consent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=509"], ["CMNS 529 TOPICS IN ORGANIZATIONAL AND MULTICULTURAL COMMUNICATION", "This course offers students a variety of special topic areas related to organizational and multicultural communication. Students will have opportunities to delve more deeply into each topic area working with instructors who have specialized expertise in that area. Typical topics include but are not limited to Global Workplaces and International Management, Organizational Identity, Critical Theory, and Latino(a) Representation. When this course is taken as an elective for the MA-RELC program, the topic must be approved by the MA-RELC Program Director. PREREQUISITE(S): Status as a Graduate Communication student or Director consent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=529"], ["CMNS 548 TEAMS AND LEADERSHIP", "Modern organizations are increasingly interested in shifting their organizational structures toward the goal of creating self-managed work teams. Therefore, the current communication graduate greatly benefits from knowledge and experience with two interdependent aspects of group dynamics: decision-making under conditions of uncertainty, and the philosophy and practice of developing groups into self-managed teams. The December quarter version of this course will combine a relatively brief period of lecture/discussion with a teamwork intensive action learning component towards the goal of making each student competent to either spearhead a change to self-managed work teams in their own organization (if called upon to do so), or to understand and weather this change in work mode without stress. PREREQUISITE(S): Status as a Graduate Communication student or department consent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=548"], ["CMNS 549 SPECIAL TOPICS IN ORGANIZATIONAL COMMUNICATION", "Course covers a variety of topics that address theories about organizational communication such as group processes, conflict management, and leadership. PREREQUISITE(S): Status as a Graduate Communication student or department consent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=549"], ["CMNS 570 INTRODUCTION TO DIGITAL CMN", "This course will provide students with a detailed critical introduction to the field of digital communication. Topics will include practical applications of digital communication across disciplines: communication studies, journalism, public relations, advertising, media and cinema studies, and communication technology. This class will offer students a glimpse of those disciplines and allow them to integrate them all together. Additionally, this course will provide an entry point for students into the program who have had little experience with either digital technology or communication courses. Ideally, this course would be a critical introduction to the field. PREREQUISITE(S): Status as a MA-DCMA, MA-MCS, or MA-DGCMED student or department consent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=570"], ["CMNS 599 RESEARCH THESIS", "Enroll in 599 during the term you plan to defend your thesis or complete your final project. This is a graded, 4-credit hour course. Tuition is charged. You must have a scheduled defense/completion date to be approved for this class. Your thesis/project advisor needs to communicate this date to the Graduate Studies Director for your program, before you are allowed to enroll. Loan deferment is allowed to those registered for this class. PREREQUISITE(S): Status as a Graduate Communication student and Director Consent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=599"], ["CMNS 601 ACTIVE DEGREE COMPLETION", "This is a 0-credit hour course that is available to students who are working actively toward the completion of a thesis or project. Enrollment in this course is limited to the two quarters prior to the defense of the thesis/project and requires graduate director approval and proof of work each quarter. No tuition is charged, only student fees (approx. $50), which allows you access to the library and other campus facilities. This course is graded as pass/fail. Eligible for loan deferment and student loans. PREREQUISITE(S): Status as a Graduate Communication or Relational Communication student or department consent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=601"], ["CMNS 602 CANDIDACY CONTINUATION", "This is a 0-credit hour course that requires permission from the graduate director. Students can enroll in 602 if they are finishing a course in which they received an incomplete (IN). If the student does not register for any regular courses in the quarter they plan to finish the incomplete, they can enroll in 602 and access the library and other campus facilities. No tuition is charged, only student fees (approx. $50). This course is graded as pass/fail. Not eligible for loan deferment or student loans. PREREQUISITE(S): Status as a Graduate Communication student is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=CMNS&catalog_nbr=602"], ["DCM 302 PROJECT MANAGEMENT: DESIGN AND ASSESSMENT", "Project Management is an important discipline that can benefit students in their careers as well as personal life. This course will explore project management methodologies, their common steps and tools. The course translates Project Management theory into a practical and effective methodology, starting with working definitions of Project and Project Management, the course examines project initiation, evaluation and organization using analytic techniques such as discounted cash flow and PERT/CPM. In addition, the course examines project execution and control, along with the documentation and communications skills needed to keep a project on track. The course concludes with an overview of project management applied to computer information systems development.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=DCM&catalog_nbr=302"], ["DCM 310 THINKING CRITICALLY", "This course strengthens students' analytical thinking ability through practice in the skills and strategies of critical thinking and reading, and in the construction and evaluation of logical arguments. In pursuing these goals, we encounter principles of logic, strategies of persuasion, and techniques of propaganda. The course presents a variety of readings, exercises, and projects designed to help students develop learning and skill in the following areas: identifying assumptions, connecting assertions to evidence, stating generalizations, analyzing arguments, and bringing multiple perspectives to bear on complex issues and questions. PREREQUISITE(S): A major in Leadership Studies, Applied Behavioral Sciences or Professional Communication is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=DCM&catalog_nbr=310"], ["DCM 313 LEARNING FROM EXPERIENCE AND SELF-ASSESSMENT", "Students will explore the nature of learning from experience and self-assessment. They will develop a reflective learning autobiography and read about theories of adult learning. Students will also be introduced to the DePaul Library, taking the online library tutorial. Time management issues and tools, as well as life stages and learning interests will also be explored. PREREQUISITE(S): A major in Leadership Studies, Applied Behavioral Sciences or Professional Communication is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=DCM&catalog_nbr=313"], ["DCM 318 SOCIAL JUSTICE IN THE PROFESSIONS", "Students will look at the nature of social justice, creating a working definition of the widely used term. Readings will guide examination of issues of social justice in students' fields or disciplines.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=DCM&catalog_nbr=318"], ["DCM 325 WORK & SOCIETY", "We will consider work from the perspective of our needs and values, but also from the perspective of the needs of society. We will also consider the value that society assigns to different types of work (and the impact of that valuation on us as individuals and as members of various social groups). Other topics will include how work affects our family and social lives, the impact of modern values on how we view our work, and the role of technology in how we do our work and in how we view our work.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=DCM&catalog_nbr=325"], ["DCM 330 PROFESSIONAL COMMUNICATION IN THE WORKPLACE", "This course consists of 10 modules and provides an overview of the fundamentals of professional writing. Through engaging in and reflecting upon a variety of professional writing tasks, you will learn the rhetorical theory and practice necessary for effective written communication in professional contexts.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=DCM&catalog_nbr=330"], ["ENV 362 SENIOR THESIS", "ENV 362 is designed for Environmental Science students working on their senior thesis. 2 quarter credits. PREREQUISITE(S): ENV 360 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=ENV&catalog_nbr=362"], ["FA 304 ADVANCED PROJECT COURSE", "The main purpose of this course is to guide you through the various steps involved in designing and carrying out an Advanced Project (AP) on a subject that is related to your particular focus Area (FA). Whether you want to address a practical problem or a theoretical question, in this course you will be guided through the process of investigating a problem or issue in depth, and establishing clear links between the definition of the problem or issue, discussion of conceptual issues, methods of investigations, analysis of findings, and practical applications. Successful completion of the Advanced Project will satisfy the F-11 and F-12 competences. PREREQUISITE(S): LL 300 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=FA&catalog_nbr=304"], ["FA 363 ACHIEVING WORK AND LIFE GOALS", "You will study the process of goal achievement from goal definition through development of a vision, review of resources and obstacles, strategic ordering of tasks and steps, effective communication and problem solving and development of an action plan. You will consider theories of goal setting, planning, communication, and negotiation, and engage in practical exercises that will require the application of theory. You will produce a completed action plan for a defined career or personal goal.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=FA&catalog_nbr=363"], ["FA 387 AFRICAN-AMERICAN STUDIES IN CRITICAL PERSPECTIVE", "This course is important for students who seek to gain a comprehensive understanding of African-American history in the United States. It will begin with discussions of African culture, the Atlantic Slave Trade, and early forms of slavery/indenturing. It will pay particular attention to the colonial and Revolutionary experience, delving into the mass exodus of Africans during the Revolutionary War, and African-American's role and position in the country's formative years. Enslavement, the Civil War and Reconstruction will follow as key areas of study. In every discussion, students will be asked to look for parallels between the contemporary and 18th and 19th century African-American experience and, where appropriate, to identify key social and cultural thinkers and leaders of the various historical periods. The primary texts for the course will be John Hope Franklin's From Slavery to Freedom, articles and readings written by scholars and important early African-American artists and intellectuals, and video presentations.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=FA&catalog_nbr=387"], ["HTHC 515 INTRO TO HEALTH COMMUNICATION", "Because of the increasing degree of health consciousness in our society, individuals not only interact more frequently with health care providers, but health care organizations play more active roles in their surrounding communities. In addition, health care cultures are changing. Health care organizations play active social and political roles when responding to national health issues or crises. Hence, it is important that we, as consumers of health care, understand the communication challenges that are inherent within health care organizations, and how those can impact the effectiveness of our communication as a participant in health care contexts. PREREQUISITE(S): Status as a Health Communication student or department consent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=HTHC&catalog_nbr=515"], ["HTHC 523 TOPICS IN HEALTH COMMUNICATION", "Topics will include: Gay, Lesbian and Transgender Health Care Issues, Patient Advocacy, Communication and Constraint, Multicultural Communication in Health Care Contexts and Advance Care Planning PREREQUISITE(S): Status as a Health Communication student or department consent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=HTHC&catalog_nbr=523"], ["HC 302 ACTIVE CITIZENS: MAKING A DIFFERENCE IN THE COMMUNITY, WORKPLACE WORLD", "Americans are known for active participation in organizations that strengthen our communities. We coach our kid's sports teams, take meals to members of our congregations, work for candidates that we believe in and join marches to support or oppose government action. With all these activities, we engage with other members of our community to make it better for ourselves and our families and to promote social justice. In this class we will evaluate our past activities in light of our values and develop a plan to improve our skills and direct our energies for civic engagement.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=HC&catalog_nbr=302"], ["IN 307 ADVANCED ELECTIVE SEMINAR", "Advanced Elective Seminar is designed to permit students to explore a topic as a group integrating various methods of inquiry and satisfy the Advanced Elective competencies: E1, E2. A specific topic, assessment and evaluation criteria as well as learning activities will be articulated by the instructor for a particular section of the course. Prerequisite: Successful completion of Research Seminar is required to register.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=IN&catalog_nbr=307"], ["JOUR 245 NEWS EDITING", "This course introduces students to editing and publishing procedures, including proofreading, copyediting and layout for different types of publications, including newsletters, brochures, periodicals and books. Skills in grammar, punctuation, style, organization, design and headline writing are emphasized along with the editor's role in the ethics of the profession, including questions of libel. Students will understand the editor's central role in the newsroom and the flow of a story from a reporter to the public. PREREQUISITE(S): JOUR 275 and JOUR 278 are prerequisites for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=245"], ["JOUR 275 INTRODUCTION TO JOURNALISM", "An introduction to the field of journalism. Instruction and practice in writing and reporting news stories. Students will learn the skills needed to become better communicators and to understand the news in the world around them.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=275"], ["JOUR 276 PHOTOJOURNALISM", "Introduction to the theoretical and technical foundations of photography with exploration of the medium's aesthetic , documentary and narrative purposes. Cross-listed as ART 377.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=276"], ["JOUR 278 NEWS REPORTING", "This course is designed to go beyond the inverted pyramid of basic news writing and focus on some of the sophisticated newsgathering techniques used by journalists. Story generation techniques will be examined along with interviewing techniques. The course will also explore how databases and documents can enhance a story, including the use of surveys, field experiments and participant observation. PREREQUISITE(S): JOUR 275 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=278"], ["JOUR 279 FEATURE WRITING", "This practicum develops the observational and narrative skills essential to writing feature stories in a variety of journalistic contexts. Students will learn the story telling techniques that emphasize human interest, description and the details of a subject. Instruction will include illustrated lectures, class discussions, writing exercises and critiques. PREREQUISITE(S): JOUR 275 and 278 are prerequisites for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=279"], ["JOUR 280 INTRODUCTION TO ONLINE REPORTING AND PRODUCTION", "This course introduces students to the principles and practices of online journalism. Students learn both conceptual and technical skills in multimedia reporting. Although the course provides groundwork in using digital tools to produce online content, the focus is on journalism. As much as possible, assignments will allow students to grasp online journalism concepts and apply them to real-world scenarios. This class uses Chicago as a testing ground for innovative reporting ideas. PREREQUISITE(S): JOUR 275 and 278 are prerequisites for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=280"], ["JOUR 330 WRITING FOR BROADCAST", "This course introduces students to the writing and formatting requirements of broadcast journalists. Part of this instruction is to give students an understanding of how writing for broadcast differs from writing for print and the awareness it takes to write copy that supports and strengthens the visuals that viewers will be watching. Strong writing is the backbone of broadcast journalism, and this course gives students a firm foundation in the writing skills that produce broadcast stories worth watching. PREREQUISITE(S): JOUR 275 and 278 are prerequisites for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=330"], ["JOUR 365 TELEVISION NEWS  I", "This is a course in electronic newsgathering. Student teams will shoot and edit stand up news packages. To do this, students will learn the basic elements in developing a broadcast news story--from originating the story idea, researching it, illustrating it, doing interviews, and then packaging the story for air. PREREQUISITE(S): JOUR 275 and JOUR 330 are a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=365"], ["JOUR 368 SPORTS REPORTING", "Sports reporting is a go-to destination for online, print, and broadcast consumers of sports information. This course gives students an understanding of the social and cultural significance of sports. It trains them to look for themes and details that go beyond the simple score of a contest to the symbolic importance of athletics in the post-modern experience. Students will complete the course with a new appreciation for what makes for strong sports reporting and what accounts for its unique hold on the popular imagination. PREREQUISITE(S): JOUR 275 and JOUR 278 are a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=368"], ["JOUR 377 SPECIAL TOPICS IN JOURNALISM", "Focuses on a specific topic related to the field of journalism. Included might be such topics as sports reporting, Chicago journalism, tabloid journalism, and Front Page news. See schedule for description of current topic. PREREQUISITE(S): JOUR 275 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=377"], ["JOUR 380 REPORTING FOR GOOD DAY DEPAUL", "This course will give students extensive experience doing on-air reporting for the DePaul student television news program, \"Good Day DePaul.\" Reporters will cover breaking news stories, features, and serious enterprise stories. Students must have experience shooting in the field and editing in Final Cut Pro, either through previous television news courses at DePaul, or from other work. Students will be permitted to take this course in two different quarters. PREREQUISITE(S): JOUR 365 and 278 are prerequisites for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=380"], ["JOUR 390 WRITING FOR THE DEPAULIA", "This course is designed for the serious journalism student who wants on-deadline experience writing for The DePaulia newspaper and web site. Students will cover beats of interest to the DePaul community throughout the quarter and also will receive assignments from DePaulia editors. Stories and beats can be as varied as campus news, sports, the arts or news in the Lincoln Park and South Loop communities. Students may repeat the course once for credit. Not available for DePaulia editors. PREREQUISITE(S): JOUR 275 and JOUR 278 are prerequisites for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=390"], ["JOUR 501 THE SOCIAL RESPONSIBILITY OF JOURNALISM", "This course introduces students to the historic development of social responsibility theory and its continuing role in defining the obligations of journalists in creating an informed citizenry as a critical part of the democratic process. The course analyzes the ongoing tension between journalistic responsibility and the obligations of news organizations to turn profits for their shareholders and the constitutional imprimatur of journalism to offer the information that makes self-governance possible. PREREQUISITE(S): Status as a Graduate Journalism student is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=501"], ["JOUR 503 REPORTING FOR CONVERGED NEWSROOMS", "This course is designed to equip journalists with the techniques needed in assembling and producing stories that can be published and distributed across integrated media platforms. Students will learn to write and edit reports for online media in ways that add value to stories and encourage readers to drill down into these news narratives for information worth knowing. Students will develop an understanding of how newsgathering practices are evolving through digital media and the role of teamwork in disseminating these stories to an informed citizenry. PREREQUISITE(S): Status as a Graduate Journalism student is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=503"], ["JOUR 510 SPORTS REPORTING", "This course gives students an historic understanding of the role of the sports writer and sports section and the impact the online universe is having on sports writing and reporting. Students will learn the values of modern sports editors and the techniques used by modern sports writers. Students will learn the perspective and context that makes good sports writing truly exceptional. PREREQUISITE(S): Status as a Graduate Journalism student is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=510"], ["JOUR 511 ARTS & ENTERTAINMENT REPORTING", "Arts and Entertainment reporting is among the most widely read, but often is the most poorly executed aspect of a publication or broadcast. Students taking this course will develop a critical appreciation for the role of arts and entertainment reporting in the history of the press and its current role in creating a culture that appreciates and understands the arts and their profound contribution to human understanding. PREREQUISITE(S): Status as a Graduate Journalism student is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=511"], ["JOUR 512 BUSINESS WRITING AND REPORTING", "This course will help students better understand the critical role that business and finance reporting plays in the United States and the world economy. Students will develop the techniques that are necessary in responsibly researching, reporting, writing, and editing business and financial news. Segments of the course will be devoted to the history of the discipline, the ethical responsibilities of the business press, and the unique opportunities now available to the digital reporter of business and financial news. PREREQUISITE(S): Status as a Graduate Journalism student is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=512"], ["JOUR 515 SPECIAL TOPICS IN JOURNALISM", "Topics have included Advanced Reporting; The Chicago Olympics; The Press and The Presidency; Reporting Campaign 2008; and From Franklin to the Internet: A History of American Journalism. Students pursuing the Sports Journalism concentration can use the following courses: Reporting the Olympics, Sports Blogging, and Sports Universe as special topics courses to count towards the concentration. PREREQUISITE(S): Status as a Graduate Journalism student is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=515"], ["JOUR 518 WRITING AND REPORTING", "This course teaches foundational journalistic skills in writing and reporting for those students coming into the program without significant previous course work or professional experience in journalism. PREREQUISITE(S): Status as a Graduate Journalism student is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=518"], ["JOUR 524 WRITING FOR THE DEPAULIA", "This course is designed for the serious Journalism student who wants on-deadline experience writing for The DePaulia newspaper and website. Students will cover stories from each section of the paper (news, features, entertainment, opinion and sports) throughout the quarter. Some assignments will come from DePaulia editors, but students are expected to come up with their own ideas. Stories can be as varied as campus news or news in the Lincoln Park and South Loop communities. Supplementing stories with photos and video is expected. PREREQUISITE(S): Status as a Graduate Journalism student is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=524"], ["JOUR 528 REPORTING FOR GOOD DAY DEPAUL", "This course will give students extensive experience doing on-air reporting for the DePaul student television news program, \"Good Day DePaul.\" Reporters will cover breaking news stories, features, and serious enterprise stories. Students must have experience shooting in the field and editing in Final Cut Pro, either through previous television news courses at DePaul, or from other work. PREREQUISITE(S): JOUR 505 and status as a Graduate Journalism student are a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=528"], ["JOUR 529 ONLINE NEWS BUREAU", "This course offers first-hand experience on a digital newsroom. Students should already have a grasp of basic online journalism skills through earlier classes or practical experience. The emphasis of the course is on producing high-quality stories both in terms of content and in terms of presentation. Throughout the quarter, students will work as multimedia producers, editors and reporters to create content for thewiredloop.info, a platform for news experimentation. PREREQUISITE(S): JOUR 503 and status as a Graduate Journalism student are a prerequisite for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=JOUR&catalog_nbr=529"], ["LAW 102 BUSINESS ORGANIZATIONS", "Provides a basic introduction to the modern American business corporation. Major subject areas covered include the steps required for organizing a corporation, the nature of the corporate entity concept, control and management of the corporation, fiduciary duties of directors and controlling shareholders and an introduction to federal securities law and partnership and agency law.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=102"], ["LAW 105 CONTRACTS", "Required for JD. Covers offer and acceptance, consideration, remedies, third party beneficiaries, conditions, anticipatory breach, impossibility and frustration, the Statute of Frauds, discharge and illegality. Common law principles and applicable portions of the Uniform Commercial Code are studied.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=105"], ["LAW 114 LEGAL  ANALYSIS RESEARCH AND COMMUNICATIONS TEACHING ASSISTANTS", "LARC TAs will work with LARC instructors to ensure a productive learning environment for students. TAs will work with one instructor for the two-semester LARC course. TAs attend LARC class, hold office hours and conferences with students, conduct research, mark ungraded assignmenets and perform other related tasks. TAs meet as a group, from time to time, with the LARC Director to ensure consistent delivery of information and advice to students. Permission required.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=114"], ["LAW 115 LEGAL ANALYSIS RESEARCH AND COMMUNICATION III", "Builds on the analysis, research, and communication skills established in LAW 112 and 119. Focuses on appellate brief writing and oral advocacy skills. PREREQUISITE(S): LAW 112 and LAW 119 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=115"], ["LAW 120 CIVIL PROCEDURE", "Required for JD. A basic survey of the fundamental principles which control the allocation and use of judicial power in the American legal system. The principle areas of inquiry include subject matter jurisdiction, personal jurisdiction, phases of a law suit, problems of diversity jurisdiction and former adjudication.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=120"], ["LAW 140 CONSTITUTIONAL LAW", "Required for JD students. This course analyzes the judicial process in constitutional law cases, focusing primarily upon the decisions of the United States Supreme Court. Emphasis is given to the nature of judicial review, the distribution of governmental power in our federal system, and the Fourteenth Amendment. Topics include the separation of powers, the federal and state commerce authority, implied fundamental rights, and equal protection of law.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=140"], ["LAW 160 PROPERTY", "Required for JD. Basic concepts of the law of property are covered through a survey of the holding of wealth and transactions in the family and commercial context, with the attendant public policy limitations on owner control. Specific topics include: concepts of ownership and possession; the divisibility of title; present and future interests; bailments; the landlord-tenant relation; interests in the land of another; recording; gifts; contracts of sale; land financing; public and private control of land use.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=160"], ["LAW 170 TORT LAW", "Required for JD. Provides an introduction to the basic theories underlying the American common law system of compensation for injuries to person and property. The major topics covered are intentional torts, negligence, strict liability and damages.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=170"], ["LAW 200 NON-PROFIT ORGANIZATIONS", "(3 hrs) Focuses on the unique characteristics of non-profit organizations and their similarities to and differences from for-profit corporations with particular attention to the role and purposes on non-profit organizations.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=200"], ["LAW 204 LAW REVIEW", "Members of the editorial board must enroll for credit. Students perform editorial tasks assigned by the editor-in-chief. Evaluation is pass/fail. Can be taken for a maxium of 2 semesters. Instructor's permission required. PREREQUISITE(S): Status as a JD student is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=204"], ["LAW 212 FEDERAL INCOME TAXATION AND FEDERAL  POLICY", "Required for Certificate in Taxation unless student takes LAW 210. Examines the economic and government policy context out of which tax laws arise, and ethical issues in tax practice, as well as substantive tax law. Designed for those who have never studied taxation. Examines how Congress uses its revenue power to shape the economy as a whole and to implement its philosophy of taxation.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=212"], ["LAW 213 DOMESTIC  VIOLENCE PRACTICUM", "This course will examine the criminal system response to domestic violence, focusing on the transformation of laws and institutions to address a problem historically conceptualized as \"private.\" Topics will include: barriers to victim cooperation and law enforcement; law and policies governing mandatory arrest and prosecution; marital rape; battering during pregnancy; battered women who kill; expert testimony on battered woman syndrome; child protection concerns; evidentiary issues arising in domestic violence trials; anti-stalking legislation; civil/criminal protective order practice; and recent US Supreme Court decisions impacting domestic violence. Course includes regularly scheduled participation in the DePaul Law Student Project at the Domestic Violence Court.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=213"], ["LAW 217 JOURNAL FOR SOCIAL JUSTICE", "The Journal for Social Justice will address areas of public interest. Members of the editorial board must enroll lin this course for credit. Students enrolled are expected to perform editorial tasks. Evaluation of student work is pass/fail.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=217"], ["LAW 223 JOURNAL OF WOMEN GENDER & THE LAW", "The Journal of Women, Gender & the Law is a student-run publication committed to advancing, domestically and internationally, the legal rights of women and those implicating the role of gender.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=223"], ["LAW 224 ASP TA", "ASP Teaching Assistants work with the Director of Academic Support to provide academic assistance to first-year law students. ASP teaching assistants: (1) conduct weekly, scheduled office hours in the ASP office; (2) assist in at least four of 23 ASP workshops throughout the semester (offering supplemental comments, answering student questions, and occasionally giving mini-presentations); (3) meet with and assist the Director in presenting workshops; (4) are available to answer student questions via email or in individual conferences outside their regular office hours. To obtain two credits, in addition to the foregoing duties, the TA prepares and schedules one to two 90-minute open Q&A sessions for 1Ls on subjects in which the TA excelled. Permission required.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=224"], ["LAW 227 CHILDREN'S HUMAN RIGHTS UNDER INTERNATIONAL LAW", "ASP Teaching Assistants work with the Director of Academic Support to provide academic assistance to first-year law students. ASP teaching assistants: (1) conduct weekly, scheduled office hours in the ASP office; (2) assist in at least four of 23 ASP workshops throughout the semester (offering supplemental comments, answering student questions, and occasionally giving mini-presentations); (3) meet with and assist the Director in presenting workshops; (4) are available to answer student questions via email or in individual conferences outside their regular office hours. To obtain two credits, in addition to the foregoing duties, the TA prepares and schedules one to two 90-minute open Q&A sessions for 1Ls on subjects in which the TA excelled. Permission required.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=227"], ["LAW 232 CATHOLIC SOCIAL JUSTICE & THE LAW", "This course introduces students to the foundation and structure of Catholic Social Teachings and asks: how (if at all) is this relevant to American legal theory, practice and public discourse? Topics considered will include, among others: economic justice, natural law, religious freedom, death penalty, war, abortion and gay marriage. At the conclusion, students will have a greater knowledge and understanding of the Catholic social ethical system and increased abilities to communicate, apply and critique other theories and institutions of social justice.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=232"], ["LAW 235 UNMANNED AIRCRAFT SYSTEMS", "This course will cover a broad range of topics relating to domestic and international operations of remotely piloted aircraft, including the procedural issues that arise from the creation of a new body of federal regulations, a comparative analysis of domestic and international substantive matters (civil liability and government liability), domestic and international regulatory systems, investigation and enforcement process, a comparison of domestic and international export controls, national security and trade law, and examination of multinational issues arising out of the relationship between aviation and maritime law. It will also examine the Federal Tort Claims Act, the government?s obligation to provide Air Traffic Control services, aircraft and pilot certification, inspection, and operational authorizations. Finally, the course will examine the issue of personal privacy, the influence of the First and Fourth Amendments, nuisance laws, and the controversial topic of targeted killings by the government?s deployment of weaponized drones and the implications of the Geneva Convention.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=235"], ["LAW 236 JOURNAL OF SPORTS LAW AND CONTEMPORARY PROBLEMS", "The Journal of Sports Law and Contemporary Problems will address issues regarding athletes, student-athletes and the overall climate in professional and amateur sports. The Journal will delve into matters of sports and culture, sports and society, sports and academics and sports and the law.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=236"], ["LAW 248 PRIVATE INTERNATIONAL AVIATION LAW", "This course will examine the international legal regime that governs air carrier liability and the unification of private international aviation law through the adoption of international conventions. The course will review liabilities of air carriers toward passengers and shippers under the Warsaw Convention and the Montreal Convention, and will examine the basic framework of the Rome Convention on third-party surface liability, and two treaties promulgated to replace the Rome Convention: the Unlawful Interference Convention and the Ground Damage Convention. Manufacturers' liability will also be reviewed, as will the international regime for aircraft financing established by the Cape Town Convention/Aircraft Protocol.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=248"], ["LAW 250 SENIOR RESEARCH SEMINAR", "Required for JD. The student must write an in-depth paper of Law Review quality on a topic of the professor's choosing.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=250"], ["LAW 263 FIDUCIARY LAW", "This course provides an introduction to fiduciary law, including core principles as they relate to the law of agency, partnerships, corporations, trusts, guardianships and professional relationships. On the public law side, topics covered will include the law governing public guardianships, public administration of private property, public administration of natural resources, and fiduciary obligations toward First-Nations. Topics will also include questions related to fiduciary status, the distinctive remedies prominent in fiduciary law, and the characteristic duties owed by fiduciaries toward their beneficiaries.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=263"], ["LAW 286 INTERNATIONAL HUMAN RIGHTS LAW PRACTICUM", "This course is a full year course which provides students with an opportunity to experience the complex and varied approaches to human rights legal advocacy in an international setting. Students will be placed on a project focused on an ongoing human rights violation. Students will work closely with grassroots human rights organizations, international NGOs and U.N. human rights experts and relevant treaty bodies. Students will be expected to devote approximately 10 hours per week to the International Human Rights Law Practicum in addition to time spent in the classroom.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=286"], ["LAW 303 BUSINESS AND COMMERCIAL LAW JOURNAL", "Members of the editorial board must enroll in this course for credit. Students enrolled are expected to perform editorial tasks assigned by the editor-in-chief. Evaluation of student work is pass/fail.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=303"], ["LAW 305 SECURED TRANSACTIONS", "Covers the law of personal property security (principally Articles Nine and Seven of the Uniform Commercial Code) and consumer financing arrangements. Emphasis is given to transactional planning of consumer, equipment, inventory, accounts and warehouse financing arrangements, and the priorities of conflicting legal interests. Provisions of the Federal Consumer Credit Code, usury laws and the Fair Credit Reporting Act are discussed.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=305"], ["LAW 308 WILLS AND TRUSTS", "A study of trusts, wills and fiduciary administration, including laws of succession, will revocation, trust powers and problems of testamentary and inter vivos gratuitous transfers.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=308"], ["LAW 312 TRIAL ADVOCACY II", "Covers advanced exercises in the mechanics of trial and trial preparation. Students develop case plans and proof analyses consistent with the theory of the case. During the trial of several simulated cases including a jury trial, students address such complex trial problems as: evidence retrieval in complex litigation, examination of medical and forensic expert witnesses, argument of motions during trial impeachment and instructions conferences. Students conduct detailed witness preparation exercises and voir dire. There is review of litigation technology and use of videotaping of student performances. PREREQUISITE(S): LAW 410 and LAW 450 are a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=312"], ["LAW 313 JUVENILE JUSTICE", "This course will cover the legal processes for dealing with juvenile crimes and status offenses.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=313"], ["LAW 319 LITIGATION STRATEGY: PRE-TRIAL, CRIMINAL", "Offers comprehensive treatment of the key problems encountered in the pretrial stages of the criminal case, including fact investigation, motions to suppress evidence, plea negotiations, preliminary hearings, arraignment, and pretrial conferences. Students conduct simulated pretrial motions, client interviews, fact investigations, counseling, negotiating and settlement sessions. Simulated depositions and motions are argued, as well as simulated pretrial conferences conducted during class. PREREQUISITE(S): LAW 410 and LAW 518 are a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=319"], ["LAW 322 INTRODUCTION TO AMERICAN LAW AND LEGAL SYSTEMS", "This course introduces students to the foundations of American law and legal practice. Students will study the structures and composition of American government institutions, the methods of legal reasoning and argument in a common law system, and the culture of legal practice. Students will also receive introductions to various areas of American legal practice, including business and commercial law, civil and criminal procedure, and administrative law. The course is graded pass/fail. Enrollment is limited to students in the LLM and MJ programs.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=322"], ["LAW 333 MUSIC LAW", "This course deals with issues relating to the organization and operation of the music industry. The course covers the principal statutes governing the industry and considers issues relating to the interests of both artists and recording companies.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=333"], ["LAW 335 PRIVACY LAW", "This course introduces and surveys the legal framework pertaining to privacy in the United States, including constitutional, statutory and common law, as it applies to various sectors of society. Topics include privacy and the media, health privacy, privacy of electronic communications, privacy and national security, and privacy in relationships and decision making.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=335"], ["LAW 336 JOURNAL OF ART TECHNOLOGY & INTELLECTUAL PROPERTY EDITORIAL BOARD", "Members of the editorial board must enroll in this course for credit. Students enrolled are expected to perform editorial tasks assigned by the editor-in-chief and are expected to supervise the student writing staff. Pass/fail only.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=336"], ["LAW 338 INTELLECTUAL PROPERTY FOR CORPORATE  TRANSACTIONAL LAWYERS", "For students interested primarily in a corporate practice. Focuses on issues a corporate practitioner should be aware of regarding transactions involving the transfer of intellectual property assets or technology, such as the sale and licensing of intellectual property generally, licensing software, Internet law, advertising clearance and litigation. PREREQUISITE(S): LAW 105 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=338"], ["LAW 341 INTERNET LAW", "This course provides a survey of selected topics in the rapidly evolving area of law applied to cyberspace and the internet. The course touches upon numerous areas of substantive law such as intellectual property, torts, jurisdiction, and privacy and the First Amendment, explores how courts have applied the law to the internet, and raises the important policy questions underlying the application of law to this new medium.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=341"], ["LAW 344 COPYRIGHT LAW", "This course will provide an in-depth study of the theory and application of copyright law. Subjects include copyright history and theory, the Digital Millennium Copyright Act, renewal and reversion, ownership issues, and a study of the interface between the economic aspects of copyright and the personal interests of authors.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=344"], ["LAW 358 EMPLOYEE BENEFITS", "The law of employee benefits affect almost every employer and employee in the country and is at the heart of an ongoing national debate about how best to structure and deliver retirement and healthcare benefits. This course provides a broad survey of the legal framework and public policies underlying retirement, health and welfare, and executive compensation benefit plans, specifically incorporating the Employee Retirement Income Security Act of 1974 (ERISA), the Internal Revenue Code, and the Patient Protection and Affordable Care Act. The course will be helpful not only for students interested in pursuing a career in employee benefits law, but also for students interested in general corporate law, ERISA and employment law litigation, tax law, investment fund management, and public policy issues more generally.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=358"], ["LAW 359 EMPLOYMENT LAW", "Examines issues in workplaces that are not governed by collective bargaining, such as hiring, wrongful termination, workplace privacy and defamation, protection against harassment, employees' legal obligations to employers.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=359"], ["LAW 369 LITIGATION LAB", "The course is a practicum in which students will work with practitioners on actual cases, under the supervision of the instructor. The Lab is designed to expose and involve students in the planning and development of various aspects of litigation practice in sophisticated cases. PREREQUISITE(S): LAW 410 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=369"], ["LAW 372 ELECTION LAW", "This course will explore the intersection of law and the political process. Topics covered may include campaign finance law, redistricting, racial and partisan gerrymandering, ballot access laws, the Voting Rights Act of 1965, modern barriers to voting, and the regulation of political parties.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=372"], ["LAW 402 ANTITRUST", "Studies the basic federal antitrust statutes which proscribe monopolization, conspiracies to restrain trade, and mergers that unduly tend to concentrate markets. This course also entails a working knowledge of American economic history, familiarity with simple rules of applied microeconomics, and a grasp of strategic commercial behavior.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=402"], ["LAW 410 EVIDENCE", "A survey of the rules governing the presentation, admission and exclusion of facts in civil and criminal judicial proceedings, including rules of competency, relevancy, privilege and hearsay.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=410"], ["LAW 411 GUIDED RESEARCH", "Students who have earned at least a 2.0 GPA after the completion of at least 31 credit hours may engage in assigned research under the direction and supervision of a full-time faculty member. Graded pass/fail.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=411"], ["LAW 415 BANKRUPTCY", "A survey of the Federal Bankruptcy Code, including the trustee's power of avoidance, Chapter 13, debtor's right to discharge, federal tax liens and priorities.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=415"], ["LAW 419 LITIGATION STRATEGY: PRE-TRIAL, CIVIL", "Offers a comprehensive treatment of the key problems encountered in the pretrial stages of civil litigation, including drafting of the complaint, case planning, interrogatories and other written discovery and pretrial orders. Students conduct simulated pretrial motions, client interviews, fact investigations, counseling, negotiating, and settlement sessions. Simulated depositions and motions argument, as well as simulated pretrial conferences, are conducted during class session. PREREQUISITE(S): LAW 410 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=419"], ["LAW 420 REAL ESTATE TRANSACTIONS", "Explores the basic concepts and documents involved in the inter vivos transfer, financing, development and use of real property. Topics covered include brokers' agreements, condominiums, title assurance, land trusts and closings. PREREQUISITE(S): LAW 160 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=420"], ["LAW 422 PUBLIC INTERNATIONAL LAW", "Covers the general principles of international relations, including such topics as what is a state, the elements of state responsibility, jurisdiction and nationality, the Law of War, the United Nations and certain international organizations.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=422"], ["LAW 427 APPELLATE TECHNIQUE", "Teaches both substantive law relating to appellate practice as well as skills training in appellate advocacy, focusing on: the ability to effectively analayze legal problems, efficiently perform legal research, collect and sort facts, write effectively and orally communicate effectively and persuasively.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=427"], ["LAW 428 INDEPENDENT STUDY", "Students who have earned at least a 3.0 GPA after completion of at least 40 credits may undertake independent study under the supervision of a full-time faculty member. The student must produce an in depth research paper of publishable quality on a topic not substantially covered by a currently offered course. Fulfills the Seminar requirements. Instructor's permission required.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=428"], ["LAW 429 LEGAL CLINIC I", "Students work in one of the clinic modules under the supervision of a clinical attorney concentrating on real life problems with real clients and organizations. Instructor's permission required.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=429"], ["LAW 436 JOURNAL OF HEALTH CARE LAW EDITORIAL  BOARD", "If a student is selected to be an editor of the Journal, the student may enroll for two units of credit per semester up to a total of six units of credit. A student is expected to work for four semesters on the publication, but may enroll for credit in any three of the four semesters in which he or she works on the Journal. Pass/fail only.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=436"], ["LAW 438 MEDIATION", "Designed for students who seek to understand the application of the zealous representation standard within the mediation process. The course provides students with a basis to evaluate critically when and how to represent clients in mediation. They experience the mediation process through classroom simulations as mediators, attorneys and clients. Through simulated teaching methodology, students focus on effective advocacy in mediation.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=438"], ["LAW 441 SPORTS LAW", "A study of the application of various legal doctrines to a broad range of sports-related activities. The course focuses upon many of the legal issues arising in professional sports, including the impact of the antitrust and labor laws and representation of the professional athlete.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=441"], ["LAW 447 PATENT LAW", "This course is designed for two types of students: (1) those who intend to practice in the area of patent law specifically; and (2) those who plan to enter into a generalized intellectual property practice. Students explore concepts and selected problems in patent law and examine the impact of policy considerations on patent statutes and jurisdictions. The course covers all substantive aspects of patent law, including patentable subject matter; patent disclosure requirements; patentability requirements; infringement - both literal and under the doctrine of equivalents; defenses; and remedies.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=447"], ["LAW 448 INTERNATIONAL BUSINESS TRANSACTIONS", "Examines the foreign law aspects of establishing American business abroad, including international investment and finance relations, and problems posed by treaty, convention and trade practice between the United States and foreign countries. PREREQUISITE(S): LAW 102 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=448"], ["LAW 449 PREDATORY LENDING", "This course will examine the origins and dimensions of predatory lending, defined as mortgage loan origination fraud and foreclosure rescue fraud. Emphasis will be given to the development of the sub-prime mortgage market, facets of predatory lending and various methods to curb it. This course will include background lectures and discussion, case study and analysis, and written and oral advocacy exercises related to actual cases.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=449"], ["LAW 450 TRIAL ADVOCACY I", "Examines fundamental trial techniques. Students are expected to perform simulated courtroom exercises in voir dire, opening statements, direct and cross-examination, introduction of exhibits, closing arguments, objections and trial motions. Students are also required to prepare trial books and exhibits and to participate in a simulated bench trial. PREREQUISITE(S): LAW 410 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=450"], ["LAW 455 LEGAL DRAFTING", "Legal drafting courses on various topics give students an opportunity to hone their research and writing skills on an advanced legal. Students may take one course per semester. All courses are limited enrollment.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=455"], ["LAW 460 BUSINESS PLANNING", "Combines advanced work in business organizations, securities law and federal taxation in the context of business planning and counseling. PREREQUISITE(S): LAW 210 or LAW 212 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=460"], ["LAW 462 INSURANCE LAW", "Cross listed course for Public Services program. Provides a comprehensive overview of the basic principles of insurance law, including: a review of how the business of insurance has developed to meet contemporary business and consumer needs; the significance of insurance in modern business; and the importance of insurance and insurance law in the practice of law. Reviews the ways in which legislators, regulators and the courts have intervened in the operations of the insurance marketplace; the purposes of such interventions, and whether such purposes have been served.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=462"], ["LAW 475 NEGOTIATIONS", "Analyzes and uses problem solving to explore the use of negotiation techniques in the legal setting.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=475"], ["LAW 477 FIRST AMENDMENT FREEDOM OF SPEECH", "This is an advanced constitutional course focusing upon First Amendment Freedom of Speech. Topics that will be covered include: the history and philosophy of freedom of speech; speech that incites action; fighting words; libel; obscenity and sexually explicit speech; commercial speech; content-based and content-neutral regulations of speech; vagueness and overbreath; prior restraints upon speech; freedom of association; the right not to speak; campaign contributions as speech; freedom of association; freedom of the press; and the broadcast media.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=477"], ["LAW 481 LEGAL PROFESSION", "Required for all JD students. Explores the role of the legal profession in American society. Legal education, admission to the bar, organization of the practicing bar, discipline, unauthorized practice, group legal services and other current problems are discussed.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=481"], ["LAW 488 LAND USE PLANNING", "An analysis of the various legal devices by which private individuals and the public attempt to control the use of land resources. Such topics as private covenants, zoning, the master plan, eminent domain, urban rehabilitation and subdivision controls are explored. PREREQUISITE(S): LAW 160 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=488"], ["LAW 498 EDUCATION LAW & POLICY", "Designed to explore some of the principal legal problems arising out of the American educational system. The right to an education, the rights and duties of teachers, and the responsibilities of students and academic freedom are some of the issues discussed.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=498"], ["LAW 506 CRIMINAL LAW", "Required for J.D. students. Provides a survey of the substantive law of crimes and defenses. This course includes a study of specific crimes, elements of criminal liability, and the purposes of punishment.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=506"], ["LAW 508 ADMINISTRATIVE LAW", "Reviews the powers and procedures of federal, state and local administrative bodies as they affect private parties, including administrative jurisdiction, adjudication, rulemaking, methods of decision, rules of evidence and judicial review. PREREQUISITE(S): LAW 140 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=508"], ["LAW 509 FAMILY LAW", "Provides an introduction to the creation and governance of family relationships, including such topics as marriage, divorce, adoption, neglect, conciliation, parentage proceedings, child custody problems, domestic violence, duty to support and property rights vis-a-vis members of the family unit.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=509"], ["LAW 513 INTERNATIONAL CRIMINAL LAW", "Covers problems of public control of criminal activity that cross international boundaries, such as extradition, air piracy, and control of drug traffic.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=513"], ["LAW 516 IMMIGRATION LAW AND POLICY", "This course gives students an understanding of the complexities of U.S. immigration law and policy. Topics of discussion include: sources of immigration power; role of the federal courts; methods of admission, including family and employment immigration; grounds of removal; and the acquisition of citizenship.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=516"], ["LAW 518 CRIMINAL PROCEDURE I: INVESTIGATION", "A survey of the administration of criminal justice, with an emphasis on pretrial procedure. Primary focus is placed upon government evidence gathering, as well as the prosecution and defense of offenders.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=518"], ["LAW 524 FIELD PLACEMENT", "This program is designed to give upper level students practical experience in an externship with a public agency, non-profit organization, member of the judiciary, or for-profit organization, such as a private law firm or in-house counsel for a corporation. Upper level students who have at least 28 credit hours and a GPA of 2.0 may apply to participate. Participants are accepted on a case by case basis. Externships are unpaid. No student can receive more than 3 credit hours per semester and no more than 9 credit hours toward their JD degree if 3 of those credits are earned during a summer placement. Otherwise, students are limited to 6 credit hours total. A placement for 3 credit hours is expected to complete 180 hours of work whereas 120 hours of work is expected for a 2 credit hour placement.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=524"], ["LAW 535 ART AND THE LAW", "Focuses on situations concerning legal issues and the arts. Includes the international regimes for copyright protection, comparison of different national copyright systems, and definition and treatment of artists' (moral) rights in their works. Ethical and legal aspects of international trade in art objects and antiquities, national and international attempts to control such trade, and issues involved in protection of cultural property and cultural resource management, as well as conflicts of law in the recovery of stolen art works.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=535"], ["LAW 546 POVERTY LAW", "Provides an overview of poverty law and the legal problems encountered by the poor in our society. The course considers legislative and administrative representation as methods of poverty advocacy, as well as the current trend away from constitutional litigation and toward state responsibility. It considers the legal developments in poverty law including housing, education, family and public benefits.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=546"], ["LAW 551 FOREIGN EXCHANGE: VIENNA, AUSTRIA", "Students enrolled in the DePaul University/Vienna University of Economics and Business (WU) program enroll in Vienna University of Economics and Business law courses under this number for one semester. The exact content depends upon the course in which the student is enrolled. Maximum of 13 credits per semester.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=551"], ["LAW 559 FOREIGN EXCHANGE:  MADRID, SPAIN", "Students enrolled in the DePaul University/Universidad Pontificia Comillas International and European Business Law (MIEBL) program enroll in Universidad Pontificia Comillas law courses under this number. The exact content depends upon the course in which the student is enrolled. Maximum of 15 credits per semester.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=559"], ["LAW 570 ELECTRONIC DISCOVERY", "This course will provide an in-depth treatment of both the legal and technical aspects of electronic discovery and provide the student with a detailed grounding in the law and application of electronic discovery principles to civil and criminal litigation. The class meets for nine weeks.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=570"], ["LAW 706 HEALTH POLICY AND THE LAW", "Cross-listed course for MBA Health Care Management and Public Services programs. Designed to introduce students to a broad variety of policy issues affecting health care and briefly touch on economics, sociology, antitrust, tort law, administrative law and important questions of national health policy.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=706"], ["LAW 714 BIOETHICS & THE LAW", "This course is a survey class, examining issues ranging from drug regulation, clinical trials, assisted reproductive technology, telemedicine, and stem cell development/regulation to the commercialization of the human body.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=714"], ["LAW 715 MASTERS ESSAY", "This is a research paper of publishable quality dealing with current subject matter. Students are expected to refine their subject into a topic which can be managed under the supervision of a faculty member. This course is open to LL.M. students only.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=715"], ["LAW 719 HEALTH CARE:  FRAUD AND ABUSE", "This course will afford the opportunity to study the now-fundamental compliance issues in health care law: anti-kickback/fraud and abuse statues and regulations. The focus will address certain regulations of substantive law as the Federal Government continues to promulgate regulation for the health care industry and as those regulations become more complex, and many regulations stem from similar sources.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=719"], ["LAW 960 3YP SEMINAR", "This course will afford the opportunity to study the now-fundamental compliance issues in health care law: anti-kickback/fraud and abuse statues and regulations. The focus will address certain regulations of substantive law as the Federal Government continues to promulgate regulation for the health care industry and as those regulations become more complex, and many regulations stem from similar sources.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=LAW&catalog_nbr=960"], ["MAT 100 INTRODUCTION TO QUANTITATIVE REASONING", "An introduction to the algebra needed for quantitative reasoning with a focus on functions and modeling. This course emphasizes the applications of elementary algebra and the use of functions to model and analyze real-world situations. Topics include functions from graphical, tabular, and symbolic points of view and models using linear, quadratic, power, exponential, and logarithmic functions. Graphing technology is used extensively. This course is prerequisite to LSP 120 and is intended for students continuing on to LSP 120. This course is not recommended for students whose plan of study includes calculus.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=100"], ["MAT 101 INTERMEDIATE ALGEBRA", "Functions, factoring, rational expressions, roots, radicals, quadratic equations, quadratic inequalities. Course meets for an additional 1 hour lab session each week for enrichment and problem solving. PREREQUISITE(S): MAT 095 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=101"], ["MAT 110 FOUNDATIONS OF MATHEMATICS FOR ELEMENTARY SCHOOL TEACHERS I", "This course gives students a deeper understanding of the foundations of elementary mathematics. Topics include problem solving, number systems, the decimal system, the number line, rounding, fractions, percentages, addition and subtraction. PREREQUISITE(S): MAT 101 or LSP 120 or equivalents or placement by test is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=110"], ["MAT 130 PRECALCULUS", "Functions and their graphs, exponential and logarithmic functions, inverse functions, polynomial and rational functions. PREREQUISITE(S): MAT 101 or placement by test is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=130"], ["MAT 131 TRIGONOMETRY", "Trigonometric functions, inverse trigonometric functions, trigonometric identities, laws of sines and cosines, polar coordinates and complex plane. PREREQUISITE(S): MAT 130 or equivalents or placement by test is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=131"], ["MAT 135 BUSINESS CALCULUS I", "Differential calculus of one or more variables with business applications. PREREQUISITE(S): MAT 130 or equivalent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=135"], ["MAT 136 BUSINESS CALCULUS II", "Integral calculus, matrix algebra, and probability theory with business applications. PREREQUISITE(S): MAT 135 or equivalent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=136"], ["MAT 137 BUSINESS STATISTICS", "Basic concepts of statistics and applications; data analysis with the use of Excel; theoretical distributions; sampling distributions; problems of estimation; hypothesis testing; problems of sampling; linear regression and correlation. PREREQUISITE(S): MAT 136 or equivalent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=137"], ["MAT 140 DISCRETE MATHEMATICS I", "Combinatorics, graph theory, propositional logic, singly-quantified statements, operational knowledge of set theory, functions, number systems, methods of direct and indirect proof. PREREQUISITE(S): MAT 130 or above or equivalents or placement by test is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=140"], ["MAT 141 DISCRETE MATHEMATICS II", "Methods of direct and indirect proof, set theoretic proofs, sequences, mathematical induction, recursion, multiply-quantified statements, relations and functions, complexity. PREREQUISITE(S): MAT 140 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=141"], ["MAT 147 CALCULUS WITH INTEGRATED PRECALCULUS I", "Limits, continuity, the derivative, rules of differentiation, and applications, with precalculus review included for each topic. The full MAT 147-8-9 sequence covers all the material of MAT 150-1-2 plus additional precalculus material. PREREQUISITE(S): MAT 130 or equivalents or placement by test is a prerequisite for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=147"], ["MAT 150 CALCULUS I", "Limits, continuity, the derivative, rules of differentiation, applications of the derivative, extrema, curve sketching, and optimization. This course meets for an additional 1-hour lab session each week for enrichment and problem solving. PREREQUISITE(S): MAT 131 or placement by test is a prerequisite for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=150"], ["MAT 151 CALCULUS II", "Definite and indefinite integrals, the Fundamental Theorem of Calculus, applications of the integral, exponential and logarithmic functions, inverse trigonometric functions, techniques of integration. This course meets for an additional 1-hour lab session each week for enrichment and problem solving. PREREQUISITE(S): MAT 150 or MAT 155 or MAT 160 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=151"], ["MAT 152 CALCULUS III", "L'Hopital's rule, improper integrals, sequences and series, Taylor polynomials. This course meets for an additional 1-hour lab session each week for enrichment and problem solving. PREREQUISITE(S): MAT 151 or MAT 161 or MAT 171 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=152"], ["MAT 160 CALCULUS FOR MATHEMATICS AND SCIENCE MAJORS I", "Limits, continuity, the derivative, rules of differentiation, applications of the derivative, extrema, curve sketching, and optimization. This course meets for an additional 1.5-hour lab session each week for enrichment and problem solving. PREREQUISITE(S): MAT 131 or placement by test is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=160"], ["MAT 170 CALCULUS  FOR LIFE SCIENCES I", "The course covers the following topics using examples from the sciences: Functions as models, logarithmic scale graphing, exponential growth and decay, difference equations and limits of sequences, geometric series, functions and limits, trigonometric functions and their limits, continuity, limits at infinity, the derivative, differentiation rules, derivatives of trigonometric and exponential functions, related rates, derivatives of inverse and logarithm functions. Course meets for an additional lab session each week during which time students will work on applied mathematics projects based on the topics covered in the course. Students majoring in the sciences should consult with their major department to decide between the 160 and 170 sequences. PREREQUISITE(S): MAT 131 or placement by test is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=170"], ["MAT 215 INTRODUCTION TO MATHEMATICAL REASONING", "An introduction to basic concepts and techniques used in higher mathematics courses: set theory, equivalence relations, functions, cardinality, techniques of proof in mathematics. The emphasis is on problem solving and proof construction by students. The department recommends that students take this course no later than the spring quarter of the sophomore year. PREREQUISITE(S): MAT 149 or MAT 152 or MAT 156 or MAT 162 or MAT 172 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=215"], ["MAT 260 MULTIVARIABLE CALCULUS I", "Vectors, dot and cross products, lines and planes, cylinders and quadric surfaces, vector-valued functions, parametrization of plane curves and three dimensional curves, arc length, curvature and normal vector, functions of several independent variables, partial derivatives, the chain rule, directional derivatives, differentials, extreme values. PREREQUISITE(S): MAT 149 or MAT 152 or MAT 156 or MAT 162 or MAT 172 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=260"], ["MAT 261 MULTIVARIABLE CALCULUS II", "Lagrange multipliers, double and iterated integrals, area by double integrals, triple integrals, triple integrals in cylindrical and spherical coordinates, line integrals, vector fields, conservative vector fields and potential functions, Green's Theorem, surface integrals, Stokes' Theorem, Gauss' Theorem. PREREQUISITE(S): MAT 260 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=261"], ["MAT 262 LINEAR ALGEBRA", "Systems of linear equations and matrices; vectors in n-space; vector spaces: linear combinations, linear independence, basis; linear transformations, change of basis, eigenvalues and eigenvectors. PREREQUISITE(S): MAT 260 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=262"], ["MAT 310 ABSTRACT ALGEBRA I", "The first quarter of a 3-quarter sequence. Topics in the sequence include the integers; abstract groups, rings, and fields; polynomial rings; isomorphism theorems; extension fields; and an introduction to Galois theory. MAT 303 is highly recommended. PREREQUISITE(S): MAT 262 and (a C-minus or better in MAT 215 or MAT 141), or instructor permission is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=310"], ["MAT 320 GEOMETRY I", "Incidence and separation properties of planes; congruences; the parallel postulate; area theory; ruler and compass construction. PREREQUISITE(S): A grade of C-minus or better in MAT 215 or MAT 141, or instructor permission is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=320"], ["MAT 335 REAL ANALYSIS I", "Real number system, completeness, supremum, and infimum, sequences and their limits, lim inf, lim sup, limits of functions, continuity. PREREQUISITE(S): (MAT 149 or MAT 152 or MAT 156 or MAT 162) and (a grade of C-minus or better in MAT 141 or MAT 215) is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=335"], ["MAT 351 PROBABILITY AND STATISTICS I", "Probability spaces, combinatorial probability methods, discrete and continuous random variables and distributions, moment generating functions, development and applications of the classical discrete and continuous distributions. PREREQUISITE(S): MAT 261 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=351"], ["MAT 356 APPLIED REGRESSION ANALYSIS", "Simple linear, multiple, polynomial and general regression models. Selection of best regression equation and examination of residuals for homoscedasticity and other diagnostics. Use of statistical software. Cross-listed with MAT 456. PREREQUISITE(S): MAT 353 and (MAT 220 or MAT 262) is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=356"], ["MAT 357 NONPARAMETRIC STATISTICS", "Inference concerning location and scale parameters, goodness of fit tests, association analysis and tests of randomness using distribution free procedures. Bootstrap techniques. Smoothing methodologies. Cross-listed with MAT 457. PREREQUISITE(S): MAT 349 or MAT 353 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=357"], ["MAT 361 THEORY OF INTEREST", "The Theory of Interest: Theory and applications of compound interest to annuities, amortization schedules, sinking funds, bonds, and yield rates. Cross-listed with MAT 461. REQUISITE(S): MAT 149 or MAT 152 or MAT 156 or MAT 162 is a prerequisite and MAT 351 is a corequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=361"], ["MAT 364 STOCHASTIC RISK MODELS", "Distributional quantities, distribution properties and classification, frequency and severity models, aggregate loss and ruin models. Cross-listed with MAT 464. PREREQUISITE(S): MAT 353 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=364"], ["MAT 368 MATHEMATICAL FINANCE", "Financial derivatives, risk management, investment strategies, arbitrage, valuation, Put-call parity, the binomial model, option pricing, lognormal models for asset prices, Black-Scholes formula, value at risk and conditional tail expectation, Brownian motion and Ito's lemma, interest rate models. Cross-listed with MAT 468. PREREQUISITE(S): MAT 353 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=368"], ["MAT 370 ADVANCED LINEAR ALGEBRA", "Vector spaces, basis and dimension; matrix representation of linear transformations and change of basis; diagonalization of linear operators; inner product spaces; diagonalization of symmetric linear operators, principal-axis theorem, and applications. Cross-listed MAT 470. PREREQUISITE(S): MAT 262 and (a grade of C-minus or better in MAT 215 or MAT 141) or instructor permission is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=370"], ["MAT 384 MATHEMATICAL MODELING", "Modeling of real world problems using mathematical methods. Includes a theory of modeling and a study of specific models, selected from deterministic, stochastic, continuous, and discrete models. Cross-listed with MAT 484. PREREQUISITE(S): (MAT 220 or MAT 262) and (MAT 348 or MAT 351) are a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=384"], ["MAT 397 MATHEMATICAL PEDAGOGY: THEORY & PRACTICE", "Introduction to current theories and practices in college mathematics instruction; helps undergraduate mathematics majors develop a deeper understanding of fundamental mathematical concepts and an awareness of how people learn mathematical ideas, and prepares them to work as consultants in mathematics instruction. Mathematical tutoring practicum is required. Four credit hour course offered over a two quarter span during the autumn and winter quarters only. See instructor for further information. This course maybe used to satisfy the junior experiential learning requirement, but it does not count toward mathematics major or minor credit. Cross-listed with MAT 697.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=397"], ["MAT 421 BASIC BIOSTATISTICS", "This course includes both data analysis and experimental design, up to and including survival analysis such as used in the analysis of clinical trials. The course will be supplemented by standard topics with application areas relevant to drug development, including pharmacokinetics, clinical trials, bioequivalence, and pharmacoepidemiology. PREREQUISITE(S): MAT 453 or instructor consent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=421"], ["MAT 435 MEASURE THEORY", "This is a course in Lebesque integration; the study of measure spaces and measurable functions; the basic theorems of Lebesque integration; Egoroff's theorem, the monotone limit theorem, the Lebesgue dominated convergence theorem; an introduction to Lp spaces, Holder's inequality, Minkowski's inequality; Fubini's theorem. PREREQUISITE(S): MAT 336 or MAT 434 is a prerequisite for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=435"], ["MAT 441 APPLIED STATISTICS I", "Parametric and non-parametric statistical inferential methods for the univariate and bivariate situations using SAS. Specific topics include classical and exploratory graphical & numerical methods of data descriptions; inference about means, medians, and associations including analysis of variance and linear regression. Data analytic projects are an integral part of the course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=441"], ["MAT 449 STATISTICAL DATA MANAGEMENT", "Parametric and non-parametric statistical inferential methods for the univariate and bivariate situations using SAS. Specific topics include classical and exploratory graphical & numerical methods of data descriptions; inference about means, medians, and associations including analysis of variance and linear regression. Data analytic projects are an integral part of the course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=449"], ["MAT 451 PROBABILITY AND STATISTICS I", "The course covers elements of probability theory; distributions of random variables and linear functions of random variables; moment generating functions; and discrete and continuous probability models. COREQUISITE(S): MAT 260 is a corequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=451"], ["MAT 456 APPLIED REGRESSION ANALYSIS", "Simple linear, multiple, polynomial and general linear regression models. Model diagnostics; Model selection and Validation. Cross-listed with MAT 356. PREREQUISITE(S): MAT 453 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=456"], ["MAT 457 NONPARAMETRIC STATISTICS", "Inference concerning location and scale parameters, goodness of fit tests, association analysis and tests of randomness using distribution free procedures. Bootstrap techniques. Smoothing methodologies. Cross-listed with MAT 357. PREREQUISITE(S): MAT 453 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=457"], ["MAT 461 ACTUARIAL SCIENCE I: THEORY OF INTEREST", "Theory of Interest: Theory and application of compound interest to annuities, amortization schedules, sinking funds, bonds, and yield rates. Cross-listed as MAT 361. REQUISITE(S): MAT 149 or MAT 152 or MAT 162 or MAT 172 is a prerequisite for this class and MAT 451 is a corequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=461"], ["MAT 464 STOCHASTIC RISK MODELS", "Introduction to risk theory and applications. Economics of insurance, individual risk models for short-term and single-term, collective risk models over an extended period, and applications. Cross-listed with MAT 364. PREREQUISITE(S): MAT 453 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=464"], ["MAT 468 MATHEMATICAL FINANCE", "This course will be required of students in the Financial Mathematics concentration. The main topics will be stochastic calculus and partial differential equations leading up to a derivation of the Black-Scholes option pricing model and its variants, along with discrete methods. This course should also be of interest to students of applied mathematics and physics. There will be opportunity to analyze real option data in conjunction with theory. Possible additional topics would include numerical methods, dividends, options on futures and exotic options. Cross-listed with MAT 368. PREREQUISITE(S): MAT 453 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=468"], ["MAT 470 ADVANCED LINEAR ALGEBRA", "Vector spaces, basis and dimension; matrix representation of linear transformations and change of basis; diagonalization of linear operators; inner product spaces; diagonalization of symmetric linear operators, principal-axis theorem, and applications. Cross-listed as MAT 370. PREREQUISITE(S): MAT 262 and (MAT 141 or MAT 215) are a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=470"], ["MAT 471 GROUP THEORY", "Course topics: Classes of groups; actions of groups on sets; Sylow theorems; decomposition of groups; structure of finite abelian groups.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=471"], ["MAT 484 MATHEMATICAL MODELING", "Modeling of real world problems using mathematical methods. Includes a theory of modeling and a study of specific models, selected from deterministic stochastic, continuous and discrete models. Cross-listed as MAT 384. PREREQUISITE(S): (MAT 220 or MAT 262) and (MAT 451 or MAT 348) are a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=484"], ["MAT 597 ADVANCED TOPICS IN ANALYSIS", "Consult course schedule for current offerings. Course may be repeated for credit when title and content change.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=597"], ["MAT 610 CALCULUS  FOR MATHEMATICS TEACHERS I", "A review of topics from precalculus using algebraic, numerical, and graphical perspectives including linear functions, exponential functions, logarithms, polynomials, and trigonometric functions. An introduction to limits, continuity, the derivative, and basic properties of real numbers. Introduction to graphing calculators and free graphing software with applications to classroom teaching.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=610"], ["MAT 640 MULTIVARIABLE CALCULUS FOR MATHEMATICS TEACHERS", "Functions of several variables, vectors, dot products and cross products, partial differentiation, directional derivatives, optimization, Lagrange multipliers, polar and spherical coordinates. Use of software packages to illustrate three dimensional objects. PREREQUISITE(S): MAT 612 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=640"], ["MAT 642 MULTIVARIABLE CALCULUS FOR TEACHERS II", "Line and surface integrals, change of variable in multiple integration, Green's and Stokes' theorems. PREREQUISITE(S): MAT 640 is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=642"], ["MAT 660 DISCRETE STRUCTURES FOR MATHEMATICS  TEACHERS", "Logic and proof, number theory, sequences and mathematical induction, sets and functions, cardinality recursion, and introduction to combinatorics.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=660"], ["MAT 680 REAL ANALYSIS FOR CALCULUS TEACHERS", "Construction and properties of the real numbers. Proofs of essential results from calculus such as the intermediate value theorem, extreme value theorem, mean value theorem, existence of the Riemann integral, and Taylor's theorem. PREREQUISITE(S): MAT 618 and MAT 660 are a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=680"], ["MAT 94 BASIC ALGEBRA", "The objective of this course is to increase the students' competence in working with ordinary arithmetic, using a large variety of practical problems and situations from basic sciences as motivation. Formerly WRC 104.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=94"], ["MAT 95 INTRODUCTORY ALGEBRA", "An introduction to functions, linear equations, linear inequalities, absolute values, systems of linear equations, exponents, and polynomials. Formerly WRC 204. PREREQUISITE(S): MAT 094 or placement is a prerequisite for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=MAT&catalog_nbr=95"], ["ORGC 201 BUSINESS AND PROFESSIONAL COMMUNICATION", "Employers demand strong communication and presentation skills. In order to compete effectively in the job market, students need to acquire and practice the written and oral communication skills needed to interview successfully. Furthermore, as a professional you will not only be expected to be a confident speaker, but also to organize and prepare clear, concise and interesting presentations. You will also need to communicate effectively while working as the member of a team or in other group contexts. In developing the knowledge, competencies and skills needed to communicate effectively in these and other contexts, this course will embrace opportunities for both critical thinking and applied problem solving. (Formerly CMNS 201)", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=ORGC&catalog_nbr=201"], ["ORGC 212 SMALL GROUP COMMUNICATION", "A survey of the variables operating in group interactions. Combines principles with practice through participation in small group experiences. Topics include group formation, group formats, organizational approaches, decision-making models, group observation and evaluation. (Formerly CMNS 212)", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=ORGC&catalog_nbr=212"], ["ORGC 251 ORGANIZATIONAL COMMUNICATION", "This course focuses on the role of communication in organizational life. Attention will be devoted to exploring how communication simultaneously shapes and is shaped by organizations. Topics include conflict and mediation, stress and social support, the supervisor-subordinate relationships, workplace diversity, organizational consultation and new communication technologies in organizations. (Formerly CMNS 251)", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=ORGC&catalog_nbr=251"], ["ORGC 316 COMMUNICATION AND GROUP DECISION-MAKING", "Advanced undergraduate course in small group communication. Students develop skills and abilities in identifying various factors that contribute to the success and failure of group decision-making in organizational contexts. Class sessions will focus on theories, research, and practices in group processes, and their applications to issues in real life. (Formerly CMNS 316)", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=ORGC&catalog_nbr=316"], ["ORGC 355 DARK SIDE OF ORGANIZATIONAL COMMUNICATION", "Advanced undergraduate course in small group communication. Students develop skills and abilities in identifying various factors that contribute to the success and failure of group decision-making in organizational contexts. Class sessions will focus on theories, research, and practices in group processes, and their applications to issues in real life. (Formerly CMNS 316)", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=ORGC&catalog_nbr=355"], ["PHY 104 THE SUN & ITS PLANETS", "This course focuses on the development of our knowledge about the Solar System with an emphasis on the origin, structure and motion of the planets and the Sun. Topics include both historical astronomy and our current understanding based on information from spacecraft sent to other planets. Cannot receive credit for both PHY 104 and PHY 114. PREREQUISITE(S): LSP 120 or HON 180 or (MAT 130 or above) or consent of instructor is a prerequisite for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=PHY&catalog_nbr=104"], ["PHY 110 BASIC ELECTRONICS: PRINCIPLES & TECHNIQUES", "Introduction to analog electronics that develops the basic principles needed to understand consumer electronics. Emphasis is given to audio applications, but the same basic principles are the foundation of modern computer technology. PREREQUISITE(S): LSP 120 or HON 180 or (MAT 130 or above) or consent of instructor is a prerequisite for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=PHY&catalog_nbr=110"], ["PHY 150 GENERAL PHYSICS I", "This course provides a comprehensive, non-calculus introduction to physics. Vectors, forces, Newtonia mechanics of translational and rotational motion. This course is intended for life science and health science majors. PREREQUISITE(S): MAT 131 or above is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=PHY&catalog_nbr=150"], ["PHY 170 UNIVERSITY PHYSICS I", "This course provides a comprehensive, calculus-based introduction to Newtonian mechanics. Topics include vectors, Newton's laws, linear and rotational motion. Course intended for majors in a physical science, required for the physics major. Autumn. COREQUISITE(S): MAT 147 or MAT 160 or MAT 170. COREQUISITE(S): MAT 147 or MAT 160 or MAT 170 is a corequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=PHY&catalog_nbr=170"], ["PHY 204 FRONTIERS OF THE UNIVERSE", "Focuses on the tremendous increase in our understanding of the universe beyond the Solar System that has occurred in recent years. Topics include stellar evolution, the properties of stars, supernova explosions, black holes, galaxies, and the origin of the universe. PREREQUISITE(S): LSP 120 or HON 180 or (MAT 130 or above) or consent of instructor is a prerequisite for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=PHY&catalog_nbr=204"], ["PHY 220 OCEANOGRAPHY", "Develops the concepts of physical oceanography. Topics include the chemical and physical properties of seawater, the dynamics of ocean currents and circulations, the physics of water waves and tides, the interaction of the ocean with the atmosphere, the formation of coastlines, and the effects of pollution on the ocean. Cross-listed with GEO 220. PREREQUISITE(S): LSP 120 or HON 180 or (MAT 130 or above) or consent of instructor is a prerequisite for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=PHY&catalog_nbr=220"], ["PHY 225 WEATHER AND CLIMATE", "Develops the physical concepts needed to understand the atmosphere, the oceans, and their interactions with the aim of building a conceptual model of weather and climate. Long-term climate variability and climate related environmental issues are also discussed. Cross-listed with GEO 225. PREREQUISITE(S): LSP 120 or HON 180 or (MAT 130 or above) or consent of instructor is a prerequisite for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=PHY&catalog_nbr=225"], ["PHY 270 UNIVERSITY PHYSICS IV", "An introduction to 20th-century physics. Topics include special relativity, quantum mechanics, and statistical analysis of data. PREREQUISITE(S): PHY 172 is a prerequisite for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=PHY&catalog_nbr=270"], ["PHY 310 MECHANICS I", "Newtonina motion in a one-, two-, and three-dimensional motion, conservative systems, variational principles, Lagrangian and Hamiltonian mechanics, central-force problems. PREREQUISITE(S): PHY 300 is a prerequisite for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=PHY&catalog_nbr=310"], ["PHY 342 COMPUTATIONAL PHYSICS", "Computational solution and simulation of physical systems; applications chosen from nonlinear dynamics, optics, central-force motion, fluids, condensed matter. PREREQUISITE(S): PHY 301 is a prerequisite for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=PHY&catalog_nbr=342"], ["PHY 385 INTRODUCTION TO PHYSICS EDUCATION RESEARCH", "This course covers effective teaching methods for physics, findings from physics eduction research, and the use of technology in physics classrooms. Course is required to serve as a Teaching Assistant within the department. Cross listed with PHY 485 PREREQUISITE(S): PHY 301 is a prerequisite for this course.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=PHY&catalog_nbr=385"], ["PHY 442 COMPUTATIONAL PHYSICS", "Contemporary Topics in physics are examined via numerical solutions. Calculations using an interactive approach and graphical representation are used extensively.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=PHY&catalog_nbr=442"], ["RELC 500 RELATIONAL COMMUNICATION THEORIES", "Students will gain an understanding of the different meta-theoretical frameworks used to explain relational communication as well as an understanding of what theories are and how theories are developed. A wide range of relational theories will be used in explaining what constitutes relational communication. Students will be provided with opportunities to apply theoretical concepts to everyday personal and professional relations as well as given opportunities to critique and analyze the efficacy of those theories presented. PREREQUISITE(S): Status as a Graduate Relational Communication student or department consent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=RELC&catalog_nbr=500"], ["RELC 511 TOPICS IN INTERPERSONAL COMMUNICATION", "Explores specialized topics within the field of relational communication. Past topics have included emotions and communication, gender and its relationship to interaction, and the social construction of interpersonal realities. PREREQUISITE(S): Status as a Graduate Relational Communication student or department consent is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=RELC&catalog_nbr=511"], ["RELC 601 ACTIVE DEGREE COMPLETION", "This is a 0-credit hour course that is available to students who are working actively toward the completion of a thesis or project. Enrollment in this course is limited to the two quarters prior to the defense of the thesis/project and requires graduate director approval and proof of work each quarter. No tuition is charged, only student fees (approx. $50), which allows you access to the library and other campus facilities. This course is graded as pass/fail. Eligible for loan deferment and student loans. PREREQUISITE(S): Status as a Graduate Relational Communication student is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=RELC&catalog_nbr=601"], ["RELC 602 CANDIDACY CONTINUATION", "This is a 0-credit hour course that requires permission from the graduate director. Students can enroll in 602 if they are finishing a course in which they received an incomplete (IN). If the student does not register for any regular courses in the quarter they plan to finish the incomplete, they can enroll in 602 and access the library and other campus facilities. No tuition is charged, only student fees (approx. $50). This course is graded as pass/fail. Not eligible for loan deferment or student loans. PREREQUISITE(S): Status as a Graduate Relational Communication student is a prerequisite for this class.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=RELC&catalog_nbr=602"], ["SNC 190 AFRICAN-AMERICAN STUDIES IN CRITICAL PERSPECTIVE", "This course is offered in SNL?s online program. Online course conform to University scheduling, but are conducted exclusively through Desire to Learn (D2L). There are no in person class meetings. This course is important for students who seek to gain a comprehensive understanding of African-American history in the United States. It will begin with discussions of African culture, the Atlantic Slave Trade, and early forms of slavery/indenturing. It will pay particular attention to the colonial and Revolutionary experience, delving into the mass exodus of Africans during the Revolutionary War, and African-American's role and position in the country's formative years. Enslavement, the Civil War and Reconstruction will follow as key areas of study. In every discussion, students will be asked to look for parallels between the contemporary and 18th and 19th century African-American experience and, where appropriate, to identify key social and cultural thinkers and leaders of the various historical periods. The primary texts for the course will be John Hope Franklin's From Slavery to Freedom, articles and readings written by scholars and important early African-American artists and intellectuals, and video presentations. Understanding the Past.", "http://offices.depaul.edu/_layouts/DUC.SR.ClassSvc/DUClassSvc.ashx?action=getclasses&strm=0980&subject=SNC&catalog_nbr=190"]]