# -*- coding: utf-8 -*-
def clean(string):
	a = ['à','á','â','ä','æ','ã','å','ā']
	A = ['À','Á','Â','Ä','Æ','Ã','Å','Ā']
	e = ['è','é','ê','ë','ē','ė','ę']
	E = ['È','É','Ê','Ë','Ē','Ė','Ę']
	y = ['ÿ']
	Y = ['Ÿ']
	u = ['û','ü','ù','ú','ū']
	U = ['Û','Ü','Ù','Ú','Ū']
	i = ['î','ï','í','ī','į','ì']
	I = ['Î','Ï','Í','Ī','Į','Ì']
	o = ['ô','ö','ò','ó','œ','ø','ō','õ']
	O = ['Ô','Ö','Ò','Ó','Œ','Ø','Ō','Õ']
	s = ['ß','ś','š']
	S = ['Ś','Š']
	l = ['ł']
	L = ['Ł']
	z = ['ž','ź','ż']
	Z = ['Ž','Ź','Ż']
	c = ['ç','ć','č']
	C = ['Ç','Ć','Č']
	n = ['ñ','ń']
	N = ['Ñ','Ń']

	if a

print clean('à')
